app/Http/Controllers/Auth/AuthenticatedSessionController.php

    public function store(LoginRequest $request)
    {
        if (!Schema::hasTable('users')) {
            return redirect()->back()->with('status', __('Base de données non migrée. Lancez les migrations.'));
        }

        $user = User::where('email',$request->email)->first();
        if($user != null)
        {
            $companyUser = User::where('id' , $user->created_by)->first();
---
select * from `users` where `email` = 'company@example.com' limit 1
select * from `users` where `id` = 8 limit 1

            return redirect()->back()->with('status', __('Access denied from this IP address.'));
        }

        $companyUser = User::find($user->created_by);
---
select * from `users` where `users`.`id` = 8 limit 1

        $user = \Auth::user();
        if(isset($user->type) && $user->type == 'company')
        {
            $plan = Plan::find($user->plan);
---
select * from `plans` where `plans`.`id` = 1 limit 1

        date_default_timezone_set($timezone);

        // Update Last Login Time
        $user->update(
            [
                'last_login_at' => Carbon::now()->toDateTimeString(),
            ]
        );
---
update `users` set `last_login_at` = '2026-03-12 14:28:23', `users`.`updated_at` = '2026-03-12 14:28:23' where `id` = 9