app/Services/Core/SecurityAccessService.php

insert into `user_session_logs` (`session_id`, `user_id`, `created_by`, `ip_address`, `user_agent`, `login_at`, `last_seen_at`, `logout_at`, `is_active`, `updated_at`, `created_at`) values ('smjTbiz1zgYPRZqBJ0HhjoDlj7HPcv78c80MMi7g', 9, 9, '127.0.0.1', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/145.0.0.0 Safari/537.36', '2026-03-12 14:28:23', '2026-03-12 14:28:23', null, 1, '2026-03-12 14:28:23', '2026-03-12 14:28:23')
select * from `user_session_logs` where (`session_id` = 'smjTbiz1zgYPRZqBJ0HhjoDlj7HPcv78c80MMi7g') limit 1
---
    public function startSession(User $user, Request $request): ?UserSessionLog
    {
        $sessionId = $request->session()->getId();
        if (blank($sessionId)) {
            return null;
        }

        return UserSessionLog::updateOrCreate([
            'session_id' => $sessionId,
        ], [
            'user_id' => $user->id,
            'created_by' => $user->creatorId(),
            'ip_address' => $request->ip(),
            'user_agent' => substr((string) $request->userAgent(), 0, 65535),
            'login_at' => now(),
            'last_seen_at' => now(),
            'logout_at' => null,
            'is_active' => true,
        ]);

update `user_session_logs` set `last_seen_at` = '2026-03-12 14:31:04', `ip_address` = '127.0.0.1', `user_agent` = 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/145.0.0.0 Safari/537.36', `user_session_logs`.`updated_at` = '2026-03-12 14:31:04' where `session_id` = 'Y0V2p4Y5QMDFlJjg4Mil8YL5jgAmmVLXtm1a3PP8' and `user_id` = 10
---
    public function touchSession(?User $user, Request $request): void
    {
        if (! $user) {
            return;
        }

        UserSessionLog::query()
            ->where('session_id', $request->session()->getId())
            ->where('user_id', $user->id)
            ->update([
                'last_seen_at' => now(),
                'ip_address' => $request->ip(),
                'user_agent' => substr((string) $request->userAgent(), 0, 65535),
            ]);