Modules/LandingPage/Entities/LandingPageSetting.php

    public static function settings()
    {
        if (!Schema::hasTable('landing_page_settings')) {
            $data = collect();
        } else {
            $data = LandingPageSetting::get();
---
select * from `landing_page_settings`