app/Http/Controllers/ApprovalRequestController.php

select count(*) as aggregate from `approval_requests` where `created_by` = 9 and `status` = 'pending' and `due_at` is not null and `due_at` <= '2026-03-12 14:30:21'
select count(*) as aggregate from `approval_requests` where `created_by` = 9 and `status` = 'pending'
select count(*) as aggregate from `approval_requests` where `created_by` = 9 and `delegated_to` = 10 and `status` = 'pending'
select count(*) as aggregate from `approval_requests` where `created_by` = 9 and `status` = 'approved'
select count(*) as aggregate from `approval_requests` where `created_by` = 9 and `status` = 'rejected'
select `id`, `name` from `approval_flows` where `created_by` = 9 order by `name` asc
select `id`, `name`, `email` from `users` where (`created_by` = 9 or `id` = 9) order by `name` asc
---
    public function index(Request $request)
    {
        if (! \Auth::user()->can('manage approval request') && ! \Auth::user()->can('show approval request')) {
            return redirect()->back()->with('error', __('Permission denied.'));
        }

        $status = $request->query('status');
        $assigned = $request->boolean('assigned');
        $query = trim((string) $request->query('q'));
        $flowId = $request->query('flow');
        $requests = ApprovalRequest::query()
            ->where('created_by', \Auth::user()->creatorId())
            ->with(['approvalFlow', 'currentStep', 'actions', 'requester', 'delegatedUser'])
            ->when($status, fn ($q) => $q->where('status', $status))
            ->when($assigned, fn ($q) => $q->where('delegated_to', \Auth::id()))
            ->when($flowId, fn ($q) => $q->where('approval_flow_id', $flowId))
            ->when($query !== '', function ($q) use ($query) {
                $q->where(function ($nested) use ($query) {
                    $nested->where('resource_id', 'like', '%'.$query.'%')
                        ->orWhereHas('approvalFlow', fn ($flow) => $flow->where('name', 'like', '%'.$query.'%'))
                        ->orWhereHas('requester', fn ($requester) => $requester->where('name', 'like', '%'.$query.'%'))
                        ->orWhereHas('delegatedUser', fn ($delegate) => $delegate->where('name', 'like', '%'.$query.'%'));
                });
            })
            ->latest('id')
            ->paginate(20);

        $overdueCount = ApprovalRequest::query()
            ->where('created_by', \Auth::user()->creatorId())
            ->where('status', 'pending')
            ->whereNotNull('due_at')
            ->where('due_at', '<=', now())
            ->count();

        $pendingCount = ApprovalRequest::query()
            ->where('created_by', \Auth::user()->creatorId())
            ->where('status', 'pending')
            ->count();

        $assignedCount = ApprovalRequest::query()
            ->where('created_by', \Auth::user()->creatorId())
            ->where('delegated_to', \Auth::id())
            ->where('status', 'pending')
            ->count();

        $approvedCount = ApprovalRequest::query()
            ->where('created_by', \Auth::user()->creatorId())
            ->where('status', 'approved')
            ->count();

        $rejectedCount = ApprovalRequest::query()
            ->where('created_by', \Auth::user()->creatorId())
            ->where('status', 'rejected')
            ->count();

        $flows = \App\Models\ApprovalFlow::query()
            ->where('created_by', \Auth::user()->creatorId())
            ->orderBy('name')
            ->get(['id', 'name']);
        $delegates = User::query()
            ->where(function ($query) {
                $query->where('created_by', \Auth::user()->creatorId())
                    ->orWhere('id', \Auth::user()->creatorId());
            })
            ->orderBy('name')
            ->get(['id', 'name', 'email']);