app/Http/Controllers/CorePlatformController.php

select * from `saved_views` where `user_id` = 9 order by `id` desc
---
    public function savedViews()
    {
        $this->authorizeAccess('manage saved view');
        $views = SavedView::query()->where('user_id', \Auth::id())->latest('id')->get();

select * from `knowledge_base_articles` where `created_by` = 9 and `status` = 'published' and (`is_featured` = 1 or `title` like '%onboarding%' or `title` like '%api%' or `title` like '%security%') order by `id` desc limit 6
select * from `knowledge_base_articles` where `created_by` = 9 and `status` = 'published' order by `id` desc limit 20
---
    public function helpCenter()
    {
        $this->authorizeAccess('show help center');
        $search = trim((string) request('q'));
        $guidedArticles = KnowledgeBaseArticle::query()
            ->where('created_by', \Auth::user()->creatorId())
            ->where('status', 'published')
            ->where(function ($query) {
                $query->where('is_featured', true)
                    ->orWhere('title', 'like', '%onboarding%')
                    ->orWhere('title', 'like', '%api%')
                    ->orWhere('title', 'like', '%security%');
            })
            ->latest('id')
            ->limit(6)
            ->get();
        $articles = KnowledgeBaseArticle::query()
            ->where('created_by', \Auth::user()->creatorId())
            ->where('status', 'published')
            ->when($search !== '', function ($query) use ($search) {
                $query->where(function ($nested) use ($search) {
                    $nested->where('title', 'like', '%'.$search.'%')
                        ->orWhere('summary', 'like', '%'.$search.'%')
                        ->orWhere('content', 'like', '%'.$search.'%');
                });
            })
            ->latest('id')
            ->limit(20)
            ->get();