app/Http/Controllers/DashboardController.php

    public function account_dashboard_index()
    {

        if (Auth::check()) {

            if (Auth::user()->type == 'super admin') {
                return redirect()->route('client.dashboard.view');
            } elseif (Auth::user()->type == 'client') {
                return redirect()->route('client.dashboard.view');
            } else {
                if (\Auth::user()->can('show account dashboard')) {
                    $data['latestIncome'] = Revenue::with(['customer'])->where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
                    $data['latestExpense'] = Payment::with(['vender'])->where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
                    $currentYer = date('Y');

                    $incomeCategory = ProductServiceCategory::where('created_by', '=', \Auth::user()->creatorId())
                        ->where('type', '=', 'income')->get();
---
select * from `revenues` where `created_by` = 9 order by `id` desc limit 5
select * from `payments` where `created_by` = 9 order by `id` desc limit 5
select * from `product_service_categories` where `created_by` = 9 and `type` = 'income'

                    $data['incomeCategory'] = $inCategory;
                    $data['incomeCatAmount'] = $inAmount;

                    $expenseCategory = ProductServiceCategory::where('created_by', '=', \Auth::user()->creatorId())
                        ->where('type', '=', 'expense')->get();
---
select * from `product_service_categories` where `created_by` = 9 and `type` = 'expense'

                    $data['currentYear'] = date('Y');
                    $data['currentMonth'] = date('M');

                    $constant['taxes'] = Tax::where('created_by', \Auth::user()->creatorId())->count();
                    $constant['category'] = ProductServiceCategory::where('created_by', \Auth::user()->creatorId())->count();
                    $constant['units'] = ProductServiceUnit::where('created_by', \Auth::user()->creatorId())->count();
                    $constant['bankAccount'] = BankAccount::where('created_by', \Auth::user()->creatorId())->count();
                    $data['constant'] = $constant;
                    $data['bankAccountDetail'] = BankAccount::where('created_by', '=', \Auth::user()->creatorId())->limit(5)->get();
                    $data['recentInvoice'] = Invoice::join('customers', 'invoices.customer_id', '=', 'customers.id')
                        ->where('invoices.created_by', '=', \Auth::user()->creatorId())
                        ->orderBy('invoices.id', 'desc')
                        ->limit(5)
                        ->select('invoices.*', 'customers.name as customer_name')
                        ->get();

                    $data['weeklyInvoice'] = \Auth::user()->weeklyInvoice();
                    $data['monthlyInvoice'] = \Auth::user()->monthlyInvoice();
                    $data['recentBill'] = Bill::join('venders', 'bills.vender_id', '=', 'venders.id')
                    ->where('bills.created_by', '=', \Auth::user()->creatorId())
                    ->orderBy('bills.id', 'desc')
                    ->limit(5)
                    ->select('bills.*', 'venders.name as vender_name')
                    ->get();

                    $data['weeklyBill'] = \Auth::user()->weeklyBill();
                    $data['monthlyBill'] = \Auth::user()->monthlyBill();
                    $data['goals'] = Goal::where('created_by', '=', \Auth::user()->creatorId())->where('is_display', 1)->get();

                    //Storage limit
                    $data['users'] = User::find(\Auth::user()->creatorId());
---
select count(*) as aggregate from `taxes` where `created_by` = 9
select count(*) as aggregate from `product_service_categories` where `created_by` = 9
select count(*) as aggregate from `product_service_units` where `created_by` = 9
select count(*) as aggregate from `bank_accounts` where `created_by` = 9
select * from `bank_accounts` where `created_by` = 9 limit 5
select `invoices`.*, `customers`.`name` as `customer_name` from `invoices` inner join `customers` on `invoices`.`customer_id` = `customers`.`id` where `invoices`.`created_by` = 9 order by `invoices`.`id` desc limit 5
select `bills`.*, `venders`.`name` as `vender_name` from `bills` inner join `venders` on `bills`.`vender_id` = `venders`.`id` where `bills`.`created_by` = 9 order by `bills`.`id` desc limit 5
select * from `goals` where `created_by` = 9 and `is_display` = 1
select * from `users` where `users`.`id` = 9 limit 1

                    $user = Auth::user();
                    $data['executiveSummary'] = $this->buildExecutiveSummary($user);
                    $layoutKey = 'dashboard_layout_account_user_' . $user->id;
                    $layoutRow = \DB::table('settings')
                        ->where('name', $layoutKey)
                        ->where('created_by', $user->creatorId())
                        ->first();
---
select * from `settings` where `name` = 'dashboard_layout_account_user_10' and `created_by` = 9 limit 1

    public function project_dashboard_index()
    {
        $user = Auth::user();

        if (\Auth::user()->can('show project dashboard')) {
            if ($user->type == 'admin') {
                return view('admin.dashboard');
            } else {
                $home_data = [];

                $user_projects = $user->projects()->pluck('project_id')->toArray();

                $project_tasks = ProjectTask::whereIn('project_id', $user_projects)->get();
                $project_expense = Expense::whereIn('project_id', $user_projects)->get();
                $seven_days = Utility::getLastSevenDays();

                // Total Projects
                $complete_project = $user->projects()->where('status', 'LIKE', 'complete')->count();
---
select `project_id` from `projects` inner join `project_users` on `projects`.`id` = `project_users`.`project_id` where `project_users`.`user_id` = 10
select `projects`.*, `project_users`.`user_id` as `pivot_user_id`, `project_users`.`project_id` as `pivot_project_id`, `project_users`.`created_at` as `pivot_created_at`, `project_users`.`updated_at` as `pivot_updated_at` from `projects` inner join `project_users` on `projects`.`id` = `project_users`.`project_id` where `project_users`.`user_id` = 10
select count(*) as aggregate from `projects` inner join `project_users` on `projects`.`id` = `project_users`.`project_id` where `project_users`.`user_id` = 10 and `status` LIKE 'complete'

                $home_data['project_status'] = $project_status;

                // Top Due Project
                $home_data['due_project'] = $user->projects()->orderBy('end_date', 'DESC')->limit(5)->get();
---
select `projects`.*, `project_users`.`user_id` as `pivot_user_id`, `project_users`.`project_id` as `pivot_project_id`, `project_users`.`created_at` as `pivot_created_at`, `project_users`.`updated_at` as `pivot_updated_at` from `projects` inner join `project_users` on `projects`.`id` = `project_users`.`project_id` where `project_users`.`user_id` = 10 order by `end_date` desc limit 5

                $home_data['last_tasks'] = ProjectTask::whereIn('project_id', $user_projects)->orderBy('end_date', 'DESC')->limit(5)->get();

                $layoutKey = 'dashboard_layout_project_user_' . $user->id;
                $layoutRow = \DB::table('settings')
                    ->where('name', $layoutKey)
                    ->where('created_by', $user->creatorId())
                    ->first();
---
select * from `settings` where `name` = 'dashboard_layout_project_user_10' and `created_by` = 10 limit 1

    public function executiveDashboard()
    {
        $user = Auth::user();
        $creatorId = $user->creatorId();

        $summary = $this->buildExecutiveSummary($user);
        $operationalPulse = $this->buildOperationalPulse($user);

        $recentInvoices = Invoice::query()
            ->with(['customer'])
            ->where('created_by', '=', $creatorId)
            ->latest('id')
            ->limit(6)
            ->get();

        $recentPurchases = Purchase::query()
            ->with(['vender'])
            ->where('created_by', '=', $creatorId)
            ->latest('id')
            ->limit(6)
            ->get();

        $urgentApprovals = ApprovalRequest::query()
            ->with(['approvalFlow', 'currentStep', 'requester', 'delegatedUser'])
            ->where('created_by', '=', $creatorId)
            ->whereIn('status', ['pending', 'in_progress', 'escalated'])
            ->orderByRaw('CASE WHEN due_at IS NULL THEN 1 ELSE 0 END')
            ->orderBy('due_at')
            ->orderByDesc('id')
            ->limit(8)
            ->get();

        $savedViews = SavedView::query()
            ->where('user_id', '=', $user->id)
            ->latest('is_default')
            ->latest('id')
            ->limit(6)
            ->get();
---
select * from `customers` where `customers`.`id` in (2)
select * from `invoices` where `created_by` = 9 order by `id` desc limit 6
select * from `purchases` where `created_by` = 9 order by `id` desc limit 6
select * from `approval_requests` where `created_by` = 9 and `status` in ('pending', 'in_progress', 'escalated') order by CASE WHEN due_at IS NULL THEN 1 ELSE 0 END, `due_at` asc, `id` desc limit 8
select * from `saved_views` where `user_id` = 9 order by `is_default` desc, `id` desc limit 6

    public function clientView()
    {

        if (Auth::check()) {
            if (Auth::user()->type == 'super admin') {
                $user = \Auth::user();
                $user['total_user'] = $user->countCompany();
                $user['total_paid_user'] = $user->countPaidCompany();
                $user['total_orders'] = Order::total_orders();
                $user['total_orders_price'] = Order::total_orders_price();
                $user['total_plan'] = Plan::total_plan();
                $most_purchese_plan = Plan::most_purchese_plan();
                if (!empty($most_purchese_plan) && !empty($most_purchese_plan->plan)) {
                    $plan = Plan::find($most_purchese_plan->plan);
---
select * from `plans` where `plans`.`id` = 1 limit 1

    public function getOrderChart($arrParam)
    {
        $arrDuration = [];
        if ($arrParam['duration']) {
            if ($arrParam['duration'] == 'week') {
                $previous_week = strtotime("-2 week +1 day");
                for ($i = 0; $i < 14; $i++) {
                    $arrDuration[date('Y-m-d', $previous_week)] = date('d-M', $previous_week);
                    $previous_week = strtotime(date('Y-m-d', $previous_week) . " +1 day");
                }
            }
        }

        $arrTask = [];
        $arrTask['label'] = [];
        $arrTask['data'] = [];
        foreach ($arrDuration as $date => $label) {

            $data = Order::select(\DB::raw('count(*) as total'))->whereDate('created_at', '=', $date)->first();
---
select count(*) as total from `orders` where date(`created_at`) = '2026-02-27' limit 1

    public function notificationPanel(Request $request)
    {
        $user = Auth::user();

        $limit = (int)$request->query('limit', 15);
        $limit = max(1, min(50, $limit));

        $items = Notification::query()
            ->where('user_id', '=', $user->id)
            ->orderByDesc('id')
            ->limit($limit)
            ->get();

        $unreadCount = Notification::query()
            ->where('user_id', '=', $user->id)
            ->where('is_read', '=', 0)
            ->count();

        $summary = [
            'total' => (int)$items->count(),
            'unread' => (int)$unreadCount,
            'workflow' => 0,
            'crm' => 0,
            'system' => 0,
        ];
---
select count(*) as aggregate from `notifications` where `user_id` = 8 and `is_read` = 0
select * from `notifications` where `user_id` = 8 order by `id` desc limit 15

    private function buildExecutiveSummary(User $user): array
    {
        $creatorId = $user->creatorId();

        $summary = [];

        if ($user->can('show account dashboard')) {
            $summary['finance'] = [
                'label' => __('Finance'),
                'headline' => __('Collection posture'),
                'value' => Invoice::query()->where('created_by', '=', $creatorId)->count(),
                'meta' => __(':count bills tracked', ['count' => Bill::query()->where('created_by', '=', $creatorId)->count()]),
                'accent' => 'finance',
                'route' => route('dashboard'),
            ];
        }

        if ($user->can('show crm dashboard')) {
            $summary['crm'] = [
                'label' => __('CRM'),
                'headline' => __('Pipeline coverage'),
                'value' => Lead::query()->where('created_by', '=', $creatorId)->count(),
                'meta' => __(':count active deals', ['count' => Deal::query()->where('created_by', '=', $creatorId)->count()]),
---
select count(*) as aggregate from `invoices` where `created_by` = 9
select count(*) as aggregate from `bills` where `created_by` = 9
select count(*) as aggregate from `leads` where `created_by` = 9
select count(*) as aggregate from `deals` where `created_by` = 9

            $summary['projects'] = [
                'label' => __('Projects'),
                'headline' => __('Operational workload'),
                'value' => Project::query()->where('created_by', '=', $creatorId)->count(),
                'meta' => __(':count open tasks', ['count' => ProjectTask::query()->where('created_by', '=', $creatorId)->where('is_complete', '=', 0)->count()]),
---
select count(*) as aggregate from `projects` where `created_by` = 9
select count(*) as aggregate from `project_tasks` where `created_by` = 9 and `is_complete` = 0

        $summary['operations'] = [
                'label' => __('Operations'),
                'headline' => __('Attention required'),
                'value' => ApprovalRequest::query()->where('created_by', '=', $creatorId)->whereIn('status', ['pending', 'in_progress', 'escalated'])->count(),
                'meta' => __(':count unread notifications', ['count' => Notification::query()->where('user_id', '=', $user->id)->where('is_read', '=', 0)->count()]),
---
select count(*) as aggregate from `approval_requests` where `created_by` = 9 and `status` in ('pending', 'in_progress', 'escalated')
select count(*) as aggregate from `notifications` where `user_id` = 10 and `is_read` = 0

            $summary['people'] = [
                'label' => __('People'),
                'headline' => __('Workforce pulse'),
                'value' => Employee::query()->where('created_by', '=', $creatorId)->count(),
                'meta' => __(':count jobs and trainings in flight', [
                    'count' => Job::query()->where('created_by', '=', $creatorId)->count() + Training::query()->where('created_by', '=', $creatorId)->count(),
                ]),
---
select count(*) as aggregate from `employees` where `created_by` = 9
select count(*) as aggregate from `trainings` where `created_by` = 9

    private function buildOperationalPulse(User $user): array
    {
        $creatorId = $user->creatorId();
        $pulse = [];

        if ($user->can('manage retail operations') && Schema::hasTable('retail_stores') && Schema::hasTable('pos_sessions') && Schema::hasTable('retail_promotions')) {
            $pulse[] = [
                'label' => __('Retail'),
                'headline' => __('Stores, POS and campaigns'),
                'value' => RetailStore::query()->where('created_by', '=', $creatorId)->where('status', '=', 'active')->count(),
                'meta' => __(':sessions open sessions, :promotions active promotions', [
                    'sessions' => PosSession::query()->where('created_by', '=', $creatorId)->where('status', '=', 'open')->count(),
                    'promotions' => RetailPromotion::query()->where('created_by', '=', $creatorId)->where('status', '=', 'active')->count(),
                ]),
                'accent' => 'crm',
                'route' => route('retail.operations.reports'),
            ];
        }

        if ($user->can('manage medical operations') && Schema::hasTable('emergency_visits') && Schema::hasTable('lab_orders') && Schema::hasTable('surgical_procedures')) {
            $pulse[] = [
                'label' => __('Medical'),
                'headline' => __('Emergency and clinical load'),
                'value' => EmergencyVisit::query()->where('created_by', '=', $creatorId)->whereIn('status', ['waiting', 'in_care'])->count(),
                'meta' => __(':labs critical labs, :surgeries planned surgeries', [
                    'labs' => LabOrder::query()->where('created_by', '=', $creatorId)->where('critical_flag', '=', true)->whereIn('status', ['ordered', 'collected', 'validated'])->count(),
                    'surgeries' => SurgicalProcedure::query()->where('created_by', '=', $creatorId)->whereIn('status', ['planned', 'in_progress'])->count(),
                ]),
---
select count(*) as aggregate from `retail_stores` where `created_by` = 9 and `status` = 'active'
select count(*) as aggregate from `pos_sessions` where `created_by` = 9 and `status` = 'open'
select count(*) as aggregate from `retail_promotions` where `created_by` = 9 and `status` = 'active'
select count(*) as aggregate from `emergency_visits` where `created_by` = 9 and `status` in ('waiting', 'in_care')
select count(*) as aggregate from `lab_orders` where `created_by` = 9 and `critical_flag` = 1 and `status` in ('ordered', 'collected', 'validated')
select count(*) as aggregate from `surgical_procedures` where `created_by` = 9 and `status` in ('planned', 'in_progress')

        }

        if ($user->can('manage medical operations') && Schema::hasTable('biomedical_assets')) {
            $dueBiomedicals = BiomedicalAsset::query()
                ->where('created_by', '=', $creatorId)
                ->get()
                ->filter(fn (BiomedicalAsset $asset) => $asset->isDueForCalibration())
                ->count();
---
select * from `biomedical_assets` where `created_by` = 9

            $pulse[] = [
                'label' => __('Biomedical'),
                'headline' => __('Calibration exposure'),
                'value' => BiomedicalAsset::query()->where('created_by', '=', $creatorId)->count(),
---
select count(*) as aggregate from `biomedical_assets` where `created_by` = 9