app/Http/Controllers/MedicalAppointmentController.php

select * from `medical_appointments` where `created_by` = 9 order by `start_at` desc
---
    public function index()
    {
        if (!\Auth::user()->can('manage medical appointment')) {
            return redirect()->back()->with('error', __('Permission denied.'));
        }

        $appointments = MedicalAppointment::with(['patient', 'doctor'])
            ->where('created_by', \Auth::user()->creatorId())
            ->orderBy('start_at', 'desc')
            ->get();