app/Http/Controllers/PartnerController.php

select * from `partners` where `created_by` = 8 order by `id` desc
---
    public function index()
    {
        if (! Auth::user()->can('manage partner') && ! Auth::user()->can('show partner')) {
            return redirect()->back()->with('error', __('Permission denied.'));
        }

        $partners = Partner::where('created_by', Auth::user()->creatorId())
            ->with(['customer', 'vender'])
            ->latest('id')
            ->get();