app/Http/Controllers/PatientController.php

select * from `patients` where `created_by` = 9 and `archived_at` is null order by `id` desc
---
    public function index(Request $request)
    {
        if (!\Auth::user()->can('manage patient')) {
            return redirect()->back()->with('error', __('Permission denied.'));
        }

        $query = Patient::where('created_by', \Auth::user()->creatorId())->whereNull('archived_at');
        $search = trim($request->get('search', ''));
        if ($search !== '') {
            $query->where(function ($q) use ($search) {
                $q->where('cin', 'like', '%' . $search . '%')
                    ->orWhere('cnam_number', 'like', '%' . $search . '%')
                    ->orWhere('first_name', 'like', '%' . $search . '%')
                    ->orWhere('last_name', 'like', '%' . $search . '%');
            });
        }

        $patients = $query->orderBy('id', 'desc')->get();