app/Http/Controllers/PharmacyDispensationController.php

select * from `pharmacy_dispensations` where `created_by` = 10 order by `created_at` desc
---
    public function index()
    {
        if (!\Auth::user()->can('manage pharmacy dispensation')) {
            return redirect()->back()->with('error', __('Permission denied.'));
        }

        $dispensations = PharmacyDispensation::with('patient')
            ->where('created_by', \Auth::user()->creatorId())
            ->latest()
            ->get();