app/Http/Controllers/PlanController.php

    public function index()
    {

        if(\Auth::user()->can('manage plan'))
        {
            if(\Auth::user()->type == 'super admin')
            {
                $plans = Plan::get();
---
select * from `plans`