app/Http/Controllers/ProductLifecycleRecordController.php

    public function index()
    {
        if (! Auth::user()->can('manage product lifecycle record') && ! Auth::user()->can('show product lifecycle record')) {
            return redirect()->back()->with('error', __('Permission denied.'));
        }

        $productLifecycleRecords = ProductLifecycleRecord::where('created_by', Auth::user()->creatorId())
            ->with(['productService', 'owner'])
            ->latest('id')
            ->get();
---
select * from `product_lifecycle_records` where `created_by` = 8 order by `id` desc