app/Http/Controllers/SuccessionPlanController.php

select * from `succession_plans` where `created_by` = 8 order by `id` desc
---
    public function index()
    {
        if (! Auth::user()->can('manage succession plan') && ! Auth::user()->can('show succession plan')) {
            return redirect()->back()->with('error', __('Permission denied.'));
        }

        $successionPlans = SuccessionPlan::where('created_by', Auth::user()->creatorId())
            ->with(['employee', 'successor'])
            ->latest('id')
            ->get();