app/Http/Controllers/SupportController.php

select * from `supports` where `created_by` = 9
select count(*) as aggregate from `supports` where `created_by` = 9
select count(*) as aggregate from `supports` where `status` = 'open' and `created_by` = 9
select count(*) as aggregate from `supports` where `status` = 'on hold' and `created_by` = 9
select count(*) as aggregate from `supports` where `status` = 'close' and `created_by` = 9
---
    public function index()
    {
        if(\Auth::user()->type == 'company')
        {
            $supports = Support::where('created_by', \Auth::user()->creatorId())->with(['createdBy','assignUser','category'])->get();
            $countTicket      = Support::where('created_by', '=', \Auth::user()->creatorId())->count();
            $countOpenTicket  = Support::where('status', '=', 'open')->where('created_by', '=', \Auth::user()->creatorId())->count();
            $countonholdTicket  = Support::where('status', '=', 'on hold')->where('created_by', '=', \Auth::user()->creatorId())->count();
            $countCloseTicket = Support::where('status', '=', 'close')->where('created_by', '=', \Auth::user()->creatorId())->count();