app/Http/Controllers/UserController.php

select * from `plans` where `plans`.`id` in (1)
select * from `users` where `created_by` = 8 and `type` = 'company'
---
    public function index()
    {
        User::defaultEmail();

        $user = \Auth::user();
        if (\Auth::user()->can('manage user')) {
            if (\Auth::user()->type == 'super admin') {
                $users = User::where('created_by', '=', $user->creatorId())->where('type', '=', 'company')->with(['currentPlan'])->get();