app/Models/Plan.php

select count(*) as aggregate from `plans`
---
    public static function total_plan()
    {
        return Plan::count();

select `id` from `plans` where `price` <= 0 limit 1
select count(*) as total, `plan` from `users` where `type` = 'company' and `plan` is not null group by `plan` order by `total` desc limit 1
---
    public static function most_purchese_plan()
    {
        $free_plan = Plan::where('price', '<=', 0)->value('id');

        $query = User::select(DB::raw('count(*) as total'), 'plan')
            ->where('type', '=', 'company')
            ->whereNotNull('plan');

        if (!empty($free_plan)) {
            $query->where('plan', '!=', $free_plan);
        }

        $plan = $query->groupBy('plan')->orderByDesc('total')->first();

select * from `plans` where `plans`.`id` is null limit 1
---
    public static function getPlan($id)
    {
        if(self::$getplans == null)
        {
            $plan = Plan::find($id);