app/Models/Utility.php

    public static function getTaxData()
    {
        $data = [];
        if (self::$rates == null) {
            $rates = Tax::get();
---
select * from `taxes`

    public static function colorset()
    {
        if (!Schema::hasTable('settings')) {
            return Utility::settings();
        }
        if (\Auth::check()) {
            if (\Auth::user()->type == 'super admin') {
                $user = \Auth::user();

                $setting = DB::table('settings')->where('created_by', $user->id)->pluck('value', 'name')->toArray();
            } else {
                $setting = DB::table('settings')->where('created_by', \Auth::user()->creatorId())->pluck('value', 'name')->toArray();
            }
        } else {
            if (!Schema::hasTable('users')) {
                $user = null;
            } else {
                $user = User::where('type', 'super admin')->first();
---
select * from `users` where `type` = 'super admin' limit 1

    public static function getStorageSetting()
    {
        if (!Schema::hasTable('settings')) {
            $data = collect();
        } else {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', 1);
            $data = $data->get();
---
select * from `settings` where `created_by` = 1