app/Models/Utility.php

    public static function getSetting()
    {
        if (self::$getsettings == null) {
            if (!Schema::hasTable('settings')) {
                self::$getsettings = collect();
                return self::$getsettings;
            }
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', 1)->get();
            if (count($data) == 0) {
                $data = DB::table('settings')->where('created_by', '=', 1)->get();
---
select * from `settings` where `created_by` = 1

    public static function getSettingById($id)
    {

        // if (self::$getsettingsid == null) {
        if (!Schema::hasTable('settings')) {
            self::$getsettingsid = collect();
            return self::$getsettingsid;
        }
        $data = DB::table('settings');
        $data = $data->where('created_by', '=', $id)->get();
        if (count($data) == 0) {
            $data = DB::table('settings')->where('created_by', '=', 1)->get();
---
select * from `settings` where `created_by` = 9
select * from `settings` where `created_by` = 1

    public static function languages()
    {
        if (self::$languageSetting == null) {
            $languages = collect(Utility::langList());

            if (\Schema::hasTable('languages')) {
                $settings = Utility::settings();

                if (!empty($settings['disable_lang'])) {
                    $disabledlang = explode(',', $settings['disable_lang']);
                    $languages = Language::whereNotIn('code', $disabledlang)->pluck('full_name', 'code');
                } else {
                    $languages = Language::pluck('full_name', 'code');
---
select `full_name`, `code` from `languages`

    public static function getTaxData()
    {
        $data = [];
        if (self::$rates == null) {
            $rates = Tax::get();
---
select * from `taxes`

    public static function addNewAccountData()
    {
        $users = User::where('type', 'company')->get();

        foreach ($users as $user) {
            $chartOfAccountTypes = Self::$chartOfAccountType;
            foreach ($chartOfAccountTypes as $k => $type) {
                $check_type = ChartOfAccountType::where('created_by', $user->id)->where('name', $type)->first();

                $chartOfAccountSubTypes = Self::$chartOfAccountSubType;
                foreach ($chartOfAccountSubTypes[$k] as $subType) {
                    $check_subtype = ChartOfAccountSubType::where('created_by', $user->id)->where('type', $check_type->id)->where('name', $subType)->first();
---
select * from `users` where `type` = 'company'
select * from `chart_of_account_types` where `created_by` = 9 and `name` = 'Assets' limit 1
select * from `chart_of_account_sub_types` where `created_by` = 9 and `type` = 1 and `name` = 'Accounts Receivable' limit 1

            'biometric attendance synchronize',
        ];
        foreach ($arrPermissions as $ap) {
            // check if permission is not created then create it.
            $permission = Permission::where('name', 'LIKE', $ap)->first();
---
select * from `permissions` where `name` LIKE 'manage form builder' limit 1

                Permission::create(['name' => $ap]);
            }
        }
        $companyRole = Role::where('name', 'LIKE', 'company')->first();
---
select * from `roles` where `name` LIKE 'company' limit 1

    public static function getAdminPaymentSetting()
    {

        $data = \DB::table('admin_payment_settings');

        $settings = [];
        if (\Auth::check()) {

            $user_id = 1;
            $data = $data->where('created_by', '=', $user_id);
        }
        $data = $data->get();
---
select * from `admin_payment_settings` where `created_by` = 1

    public static function getCompanyPaymentSetting($user_id)
    {

        $data = \DB::table('company_payment_settings');
        $settings = [];
        $data = $data->where('created_by', '=', $user_id);
        $data = $data->get();
---
select * from `admin_payment_settings` where `created_by` = 1

    public static function colorset()
    {
        if (!Schema::hasTable('settings')) {
            return Utility::settings();
        }
        if (\Auth::check()) {
            if (\Auth::user()->type == 'super admin') {
                $user = \Auth::user();

                $setting = DB::table('settings')->where('created_by', $user->id)->pluck('value', 'name')->toArray();
            } else {
                $setting = DB::table('settings')->where('created_by', \Auth::user()->creatorId())->pluck('value', 'name')->toArray();
            }
        } else {
            if (!Schema::hasTable('users')) {
                $user = null;
            } else {
                $user = User::where('type', 'super admin')->first();
            }
            $setting = DB::table('settings')
                ->where('created_by', $user?->id ?? 1)
                ->pluck('value', 'name')
                ->toArray();
---
select `value`, `name` from `settings` where `created_by` = 8
select * from `users` where `type` = 'super admin' limit 1

    public static function get_superadmin_logo()
    {
        $is_dark_mode = self::getValByName('cust_darklayout');
        $setting = DB::table('settings')->where('created_by', Auth::user()->id)->pluck('value', 'name')->toArray();
---
select `value`, `name` from `settings` where `created_by` = 1

    public static function getStorageSetting()
    {
        if (!Schema::hasTable('settings')) {
            $data = collect();
        } else {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', 1);
            $data = $data->get();
---
select * from `settings` where `created_by` = 1

    public static function getCookieSetting()
    {
        $data = \DB::table('settings')->whereIn('name', [
            'enable_cookie',
            'cookie_logging',
            'cookie_title',
            'cookie_description',
            'necessary_cookies',
            'strictly_cookie_title',
            'strictly_cookie_description',
            'more_information_description',
            'contactus_url'
        ])->get();
---
select * from `settings` where `name` in ('enable_cookie', 'cookie_logging', 'cookie_title', 'cookie_description', 'necessary_cookies', 'strictly_cookie_title', 'strictly_cookie_description', 'more_information_description', 'contactus_url')

    public static function languagecreate()
    {
        $languages = Utility::langList();

        foreach ($languages as $key => $lang) {
            $languageExist = Language::where('code', $key)->first();
---
select * from `languages` where `code` = 'ar' limit 1